# БОТ --------------------------
TOKEN = '7836783041:AAFtLuQazBhqUs78zrjek9CB2W5TE8vmmOI'
ADMIN_CHANNEL_ID = '@dgfdgdfgdfdfg'

# СООБЩЕНИЯ --------------------
HELLO_MESSAGE = "Добро пожаловать! Этот бот помогает пройти первичный этап отбора на вакансию «Специалист технической поддержки (удаленно)».\n\nНажмите «Начать», чтобы заполнить анкету или узнать больше о вакансии."
WORK_INFO = f"Вакансия: Специалист технической поддержки (удаленно).\n\nОписание:\n<Описание вакансии>.\n\nУсловия работы:\n<Условия работы>.\n\nНажмите «Начать», чтобы приступить."
START_FORM = "Нажмите «Начать», чтобы заполнить анкету."
END_FORM = "Спасибо! Ваша анкета отправлена. В ближайшее время вы получите предварительный ответ по вашей кандидатуре."
REFERRAL_NOTIFICATION = 'Прошу вас не игнорировать оформление карты. К моменту трудоустройства вам необходимо будет получить и активировать зарплатную карту.\n\nТакже напоминаем о нашей программе «Приведи друга». Участие в программе позволяет вам и приглашенному другу получить по 30 000 рублей. Условие — успешное прохождение отбора и работа друга в течение минимум 3 недель.\n\nДля участия просто поделитесь вашей уникальной ссылкой. Все кандидаты, которые придут по вашей ссылке, будут закреплены за вами, а бонусы будут автоматически начислены.'
CONFIRM_WORK = "Отлично! Чтобы продолжить, вам необходимо оформить бесплатную дебетовую карту, на которую будет переводиться ваша заработная плата.\n\nДля данной вакансии предусмотрена еженедельная оплата, исходя из отработанных часов, по ставке 320 рублей/час. Учитывается время нахождения в сети, в течение которого к вам могут обратиться за помощью (даже если никто не напишет)."
REFERRAL_SHARE = "Давай работать и зарабатывать вместе! Вакансия: «Сотрудник техподдержки письменно (удаленно)». Присоединяйся!"
END_MESSAGE = "Спасибо! Ваша анкета отправлена. Мы свяжемся с вами после активации зарплатной карты для выдачи обучающего материала и введения в курс работы.\n\nПожалуйста при оформлении карты нажмите соответствующую кнопку, чтобы ускорить процесс проверки!*"
CARD_END_MESSAGE = "Спасибо, напоминаем что для продолжения вам нужно оформить, получить и активировать карту.\n\nДля активации нужно совершить любую транзакцию по карте.\n\nЕсли вы выполнили условия то ожидайте, в случае положительного решения с вами вяжется менеджер в ближайшее время.\n\n"
CANCEL_WORK = "Для повторного заполения анкеты введите команду /start"

# ЗАПОЛЕНЕНИЕ АНКЕТЫ -----------
NAME_AND_SURNAME = "Пожалуйста, укажите ваше имя и фамилию."
CONTACT = "Укажите ваш номер телефона или email для связи."
AGE = "Укажите, пожалуйста, сколько вам полных лет на момент заполнения анкеты."
WORK_TYPE = "Вы рассматриваете вакансию как основную работу или как подработку?"
CITY = "Напишите город вашего проживания."